ドキュメント: 図をMermaid記法へ変更
